# AddValueString Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..AddValueString Method
ExporterIFCUtils Class See Also
---
Adds a string value to a built-in parameter.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static void AddValueString(
	Element element,
	ElementId builtInParameter,
	string propertyValue
)
```

Visual Basic
---
```text
Public Shared Sub AddValueString ( _
	element As Element, _
	builtInParameter As ElementId, _
	propertyValue As String _
)
```

Visual C++
---
```text
public:
static void AddValueString(
	Element^ element,
	ElementId^ builtInParameter,
	String^ propertyValue
)
```

# ### Parameters
element
    Type: Autodesk.Revit.DB..::..Element The element.
builtInParameter
    Type: Autodesk.Revit.DB..::..ElementId The built-in parameter id.
propertyValue
    Type: System..::..String The new value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace